In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5),
                   })

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -2.049469  1.194510
1  X   beta -0.939563  1.673940
2  Y  alpha -0.760218 -0.650520
3  Y   beta -0.066704  0.897486
4  Z  alpha  0.562312  0.048516

In [6]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [8]:
group1.mean()

k1
X   -1.494516
Y   -0.413461
Z    0.562312
Name: dataset1, dtype: float64

In [ ]:
# 外部のデータをキーとして持ってくる（定義）
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
#  それぞれでグループ化
dframe['dataset1'].groupby([cities,month]).mean()

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.494516  1.434225
Y  -0.413461  0.123483
Z   0.562312  0.048516

In [11]:
# 複数列の指定
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -2.049469  1.194510
   beta  -0.939563  1.673940
Y  alpha -0.760218 -0.650520
   beta  -0.066704  0.897486
Z  alpha  0.562312  0.048516

In [17]:
#出力列を限定する
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.194510
   beta   1.673940
Y  alpha -0.650520
   beta   0.897486
Z  alpha  0.048516

In [23]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.494516  1.434225
Y  -0.413461  0.123483
Z   0.562312  0.048516

In [22]:
for name, group in dframe.groupby('k1'):
    print('this is the {} group'.format(name))
    print(group)
    print('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -2.049469   1.19451
1  X   beta -0.939563   1.67394


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.760218 -0.650520
3  Y   beta -0.066704  0.897486


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.562312  0.048516

In [28]:
for name, group in dframe.groupby(['k1','k2']):
    print('this is the {} group'.format(name))
    print(group)
    print('\n')

this is the ('X', 'alpha') group
  k1     k2  dataset1  dataset2
0  X  alpha -2.049469   1.19451


this is the ('X', 'beta') group
  k1    k2  dataset1  dataset2
1  X  beta -0.939563   1.67394


this is the ('Y', 'alpha') group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.760218  -0.65052


this is the ('Y', 'beta') group
  k1    k2  dataset1  dataset2
3  Y  beta -0.066704  0.897486


this is the ('Z', 'alpha') group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.562312  0.048516

In [29]:
gr = dframe.groupby('k1')
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -2.049469   1.19451
1  X   beta -0.939563   1.67394

In [30]:
group_dict = dict(list(dframe.groupby('k1')))

In [31]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -2.049469   1.19451
1  X   beta -0.939563   1.67394

In [32]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis = 1)))

In [33]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -2.049469  1.194510
 1 -0.939563  1.673940
 2 -0.760218 -0.650520
 3 -0.066704  0.897486
 4  0.562312  0.048516,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [47]:
animals = DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])

In [48]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [49]:
animals.loc['Cat', ['W', 'Y']] = np.nan 
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [50]:
behavior_map =  {'W': 'bad', 'X': 'good', 'Y': 'bad','Z': 'good'}

In [51]:
animals_col = animals.groupby(behavior_map, axis = 1)

In [52]:
animals_col.sum()

        bad  good
Dog     2.0   4.0
Cat     0.0  12.0
Bird   18.0  20.0
Mouse  26.0  28.0

In [54]:
behavior_series = Series(behavior_map)
behavior_series

W     bad
X    good
Y     bad
Z    good
dtype: object

In [59]:
animals.groupby(behavior_series, axis =1).count()

       bad  good
Dog      2     2
Cat      0     2
Bird     2     2
Mouse    2     2

In [60]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [62]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [64]:
keys = ['A', 'B', 'A', 'B']
animals.groupby([len, keys]).sum()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   0.0   5   0.0   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15